app/Models/CategoryModel.php

SELECT `categorias`.`NOMBRE`
FROM `categorias`
JOIN `proyecto_categoria` ON `proyecto_categoria`.`ID_CATEGORIA` = `categorias`.`ID_CATEGORIA`
WHERE `proyecto_categoria`.`ID_PROYECTO` = '1'
---
    public function getCategory($id) {
        $builder = $this->db->table('categorias');
        $builder->select('categorias.NOMBRE');
        $builder->join('proyecto_categoria', 'proyecto_categoria.ID_CATEGORIA = categorias.ID_CATEGORIA');
        $builder->where('proyecto_categoria.ID_PROYECTO', $id);
        $query = $builder->get();