app/Models/ProjectModel.php

SELECT `proyectos`.*
FROM `proyectos`
---
    public function getImage($idProject)
    {
        $builder = $this->builder();
        $builder->select('portada');
        $builder->where('ID_PROYECTO', $idProject);
        $query = $builder->get();